nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/ecat_examples/dual_cores_servo_motor/remote/cm7_core1/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMX9352xxxxM
package_id: MIMX9352DVUXM
mcu_data: ksdk2_0
processor_version: 0.12.3
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"
#include "fsl_xbar.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) 
{
  BOARD_InitI2C6Pins();         /* Init I2C pins to be able control MUX signals */
  XBAR_Init(kXBAR_DSC1); 
  
  /* LPUART11/12 via FTDI chip (J15 connector). SW7-2 to ON for LPUART12 via FTDI. */
  BOARD_SelectFTUART();

  /* Motor controller 1 (main connector for motor control example) */
  BOARD_Init_M1_PWM();          /* Init PWM pins */
  BOARD_Init_M1_ENDAT2P2();     /* Init EnDat2.2 encoder pins */
  BOARD_Init_M1_SINC();         /* Init SINC filter pins */ 
  BOARD_Init_M1_FAULTS();       /* Init over-current and over-voltage protection pins */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm2Mux0Trigger0, kXBAR1_OutputSinc1ExtTrigger0);   /* Route FlexPWM2_SM0_trig0 -> SINC1_htrig0 */ 
  
  /* Motor controller 2 (main connector for motor control example) */
  BOARD_Init_M2_PWM();          /* Init PWM pins */
  BOARD_Init_M2_ENDAT2P2();         /* Init EnDat2.2 encoder pins */
  BOARD_Init_M2_SINC();         /* Init SINC filter pins */ 
  BOARD_Init_M2_FAULTS();       /* Init over-current and over-voltage protection pins */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm1Mux0Trigger0, kXBAR1_OutputSinc2ExtTrigger0);   /* Route FlexPWM1_SM0_trig0 -> SINC2_htrig0 */

 
  /* Route synchronization signal FlexPWM2_SM0_trig1 -> FlexPWM1_SM0_ExtSync0 */  
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm2Mux1Trigger0, kXBAR1_OutputFlexpwm1ExtSync0);
}

void BOARD_Init_M1_PWM(void)
{
  /* Select Motor controller 1 */
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, ETH2_SEL);
  
  /* M1_PWM_AT	ETH2_TXD3 / SEMC_ADDR7 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TXD3__FLEXPWM2_PWMA0, 0);
  /* M1_PWM_AB	ETH2_TXD2 / USB2.OTG_OC / SEMC_ADDR6 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TXD2__FLEXPWM2_PWMB0, 0);
  /* M1_PWM_BT	ETH2_TXD1 / USB1.OTG_OC / SEMC_ADDR5 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TXD1__FLEXPWM2_PWMA1, 0);
  /* M1_PWM_BB	ETH2_TXD0 / SEMC_ADDR4 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TXD0__FLEXPWM2_PWMB1, 0);
  /* M1_PWM_CT	ETH2_TXCTL / SEMC_DATA16 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TX_CTL__FLEXPWM2_PWMA2, 0);
  /* M1_PWM_CB	ETH2_TXCLK / SEMC_DATA17 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_TX_CLK__FLEXPWM2_PWMB2, 0);

}

void BOARD_Init_M1_ENDAT2P2(void)
{
  /* Init Encoder 1 routed to Motor controller 1 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_RXD0__DIG_ENCODER2_DATA_EN, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_RXD1__DIG_ENCODER2_DATA_CLK, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_RXD2__DIG_ENCODER2_DATA_OUT ,0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH2_RXD3__DIG_ENCODER2_DATA_IN ,0U);
  
  /* Select Motor controller 1 */
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, ETH2_SEL);
  SDK_DelayAtLeastUs(100U, SystemCoreClock);
 
  /* EXTENDED PWM to trigger EnDat getsens */
  BLK_CTRL_WAKEUPMIX->XBAR_TRIG_SYNC_CTRL2 |= BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_SYNC_ENABLE(1U);
  BLK_CTRL_WAKEUPMIX->XBAR_TRIG_SYNC_CTRL3 |= BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL3_PULSE_WIDTH0(7U);
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm2Mux0Trigger1, kXBAR1_OutputTriggerSyncAsyncIn0);
  XBAR_SetSignalsConnection(kXBAR1_InputTriggerSyncSyncOut0, kXBAR1_OutputEndat22StrN);
}

void BOARD_Init_M1_SINC(void)
{
  /* Select Motor controller 1 (SINC filer signals) */
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, SD1_SEL);

  /* M1_SINCA_D0	SD1_CMD */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD1_CMD__SINC1_EMBIT0, 0);
  /* M1_SINCA_D1	SD1_DATA1 */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD1_DATA1__SINC1_EMBIT1, 0);
  /* M1_SINCA_D2	SD1_DATA3 */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD1_DATA3__SINC1_EMBIT2, 0);
  /* M1_SINCA_D3	SD1_DATA5 */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD1_DATA5__SINC1_EMBIT3, 0);
  /* M1_SINCA_CLK0	SD1_CLK */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD1_DATA6__SINC1_MOD_CLK0, 0);
}

void BOARD_Init_M1_FAULTS(void)
{
 /* Select Motor controller 1 */
  BOARD_EXPANDER_SetPinAsOutput(BOARD_PCA6416_I2C6_S3_ID, CAN5_SEL);
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, CAN5_SEL);
  SDK_DelayAtLeastUs(100U, SystemCoreClock);

  BOARD_EXPANDER_SetPinAsOutput(BOARD_PCA6416_I2C6_S3_ID, SAI3_SEL);
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, SAI3_SEL);
  SDK_DelayAtLeastUs(100U, SystemCoreClock);

  /* Over-currrent protection */
  BLK_CTRL_WAKEUPMIX->IOMUX_GPIO_CTRL_0 = ((BLK_CTRL_WAKEUPMIX->IOMUX_GPIO_CTRL_0 &
    (~(BLK_CTRL_WAKEUPMIX_IOMUX_GPIO_CTRL_0_sel5_MASK | BLK_CTRL_WAKEUPMIX_IOMUX_GPIO_CTRL_0_ovr5_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_IOMUX_GPIO_CTRL_0_sel5(0x01U)        /* MUX8 selected */ 
      | BLK_CTRL_WAKEUPMIX_IOMUX_GPIO_CTRL_0_ovr5(0x00U)        /* input direction - not sure about this */
  );   

  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO57__GPIO3_IO25, 0U);

  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarIn21, kXBAR1_OutputFlexpwm2IppIndFault0);
  
  /* Over-votlage protection */
  /* Set XBAR_INOUT20 as input*/
  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_20_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_20(0x00U) /* IOMUXC XBAR_INOUT20 function direction select: XBAR_INOUT as input */ 
  );
  
  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO56__XBAR1_XBAR_INOUT20, 0U);
  
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarIn20, kXBAR1_OutputFlexpwm2IppIndFault1);
}

void BOARD_Init_M2_PWM(void)
{
  /* Select Motor controller 2 (PWM signals) */
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, ETH3_SEL);
  
  /* M2_PWM_AT	ETH3_TXD3 / SEMC_DATA8 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TXD3__FLEXPWM1_PWMA0, 0);
  /* M2_PWM_AB	ETH3_TXD2 / SEMC_DATA9 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TXD2__FLEXPWM1_PWMB0, 0);
  /* M2_PWM_BT	ETH3_TXD1 / SEMC_DATA10 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TXD1__FLEXPWM1_PWMA1, 0);
  /* M2_PWM_BB	ETH3_TXD0 / SEMC_DATA11 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TXD0__FLEXPWM1_PWMB1, 0);
  /* M2_PWM_CT	ETH3_TXCTL / SEMC_ADDR12 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TX_CTL__FLEXPWM1_PWMA2, 0);
  /* M2_PWM_CB	ETH3_TXCLK / SEMC_ADDR11 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_TX_CLK__FLEXPWM1_PWMB2, 0);

}

void BOARD_Init_M2_ENDAT2P2(void)
{
  /* Init Encoder 2 routed to Motor controller 2 */
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD0__DIG_ENCODER1_DATA_EN, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD1__DIG_ENCODER1_DATA_CLK, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD2__DIG_ENCODER1_DATA_OUT, 0U);
  IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD3__DIG_ENCODER1_DATA_IN, 0U);
  
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, ETH3_SEL);
  SDK_DelayAtLeastUs(100U, SystemCoreClock);
  
  /* EXTENDED PWM to trigger EnDat StrN */
  BLK_CTRL_WAKEUPMIX->XBAR_TRIG_SYNC_CTRL2 |= BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_SYNC_ENABLE(2U);
  BLK_CTRL_WAKEUPMIX->XBAR_TRIG_SYNC_CTRL3 |= BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL3_PULSE_WIDTH1(7U);
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm1Mux0Trigger1, kXBAR1_OutputTriggerSyncAsyncIn1);
  
  /* Trigger EnDat2.2 */
  XBAR_SetSignalsConnection(kXBAR1_InputTriggerSyncSyncOut1, kXBAR1_OutputEndat21StrN);
}

void BOARD_Init_M2_SINC(void)
{
  /* Select Motor controller 2 (SINC filer signals) */
  BOARD_EXPANDER_SetPinToLow(BOARD_PCA6416_I2C6_S3_ID, SD2_SEL);
  
  /* M2_SINCA_D0	SD2_CLK */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD2_CLK__SINC2_EMBIT0, 0);
  /* M2_SINCA_D1	SD2_DATA0 */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD2_DATA0__SINC2_EMBIT1, 0);
  /* M2_SINCA_D2	SD2_DATA2 */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD2_DATA2__SINC2_EMBIT2, 0);
  /* M2_SINCA_D3	SD2_RESET_B */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD2_RESET_B__SINC2_EMBIT3, 0);
  /* M2_SINCA_CLK0	SD2_CD_B */
  IOMUXC_SetPinMux(IOMUXC_PAD_SD2_GPIO0__SINC2_MOD_CLK1, 0);
}

void BOARD_Init_M2_FAULTS(void)
{
  /* Over-currrent protection */
  /* Set XBAR_INOUT9 as input*/
  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9(0x00U) /* IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as input */ 
  );
  
  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO33__XBAR1_XBAR_INOUT9, 0U); 
  
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarIn09, kXBAR1_OutputFlexpwm1IppIndFault0);

  
  /* Over-votlage protection */
  /* Set XBAR_INOUT8 as input*/
  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8(0x00U) /* IOMUXC XBAR_INOUT8 function direction select: XBAR_INOUT as input */ 
  );
  
  IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO32__XBAR1_XBAR_INOUT8, 0U); 
  
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarIn08, kXBAR1_OutputFlexpwm1IppIndFault1);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
